; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v11 ?v5)
             (pred_1 ?v2 ?v4)
             (pred_12 ?v11 ?v4)
             (pred_2 ?v3 ?v11 )
	     (pred_9 ?v11)
             (pred_4 ?v6)
             (pred_11 ?v2)
             (pred_6 ?v4)
             (pred_10 ?v11)
             (pred_7 ?v2)
             (pred_8 ?v11)
             (pred_3 ))



(:action op_3
:parameters (?v7 ?v9 ?v8 ?v13)
:precondition (and (pred_4 ?v7) (pred_4 ?v9) (pred_11 ?v8) (pred_6 ?v13)
          (pred_5 ?v7 ?v9) (pred_1 ?v8 ?v13)
                   (pred_12 ?v9 ?v13) (pred_9 ?v7) 
                   (pred_10 ?v9) (pred_7 ?v8))
:effect (and  (pred_8 ?v9) (not (pred_10 ?v9))))


(:action op_1
:parameters (?v7 ?v10)
:precondition (and (pred_4 ?v7) (pred_4 ?v10)
               (pred_9 ?v7) (pred_5 ?v7 ?v10) (pred_8 ?v10))
:effect (and (pred_9 ?v10) (not (pred_9 ?v7))))

(:action op_4
:parameters (?v7 ?v8)
:precondition (and (pred_4 ?v7) (pred_11 ?v8) 
                  (pred_9 ?v7) (pred_2 ?v8 ?v7) (pred_3 ))
:effect (and (pred_7 ?v8)
   (not (pred_2 ?v8 ?v7)) (not (pred_3 ))))


(:action op_5
:parameters (?v7 ?v12 ?v1)
:precondition (and (pred_4 ?v7) (pred_11 ?v12) (pred_11 ?v1)
                  (pred_9 ?v7) (pred_7 ?v1) (pred_2 ?v12 ?v7))
:effect (and (pred_7 ?v12) (pred_2 ?v1 ?v7)
        (not (pred_7 ?v1)) (not (pred_2 ?v12 ?v7))))

(:action op_2
:parameters (?v7 ?v8)
:precondition (and (pred_4 ?v7) (pred_11 ?v8) 
                  (pred_9 ?v7) (pred_7 ?v8))
:effect (and (pred_3 ) (pred_2 ?v8 ?v7) (not (pred_7 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_09 obj_16 obj_11 obj_13 obj_01 obj_19 obj_07 obj_10 obj_14 obj_08 obj_18 obj_17 obj_02 obj_12 obj_04
    obj_20 obj_06
    obj_03 obj_15
    )

    (:init
       (pred_3)

       (pred_4 obj_05)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_19)
       (pred_4 obj_07)
       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_17)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_06)
       (pred_11 obj_03)
       (pred_11 obj_15)

       (pred_5 obj_05 obj_13)
       (pred_5 obj_05 obj_09)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_16)
       (pred_5 obj_09 obj_05)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_16 obj_09)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_13 obj_01)
       (pred_5 obj_13 obj_05)
       (pred_5 obj_01 obj_14)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_19 obj_08)
       (pred_5 obj_19 obj_07)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_19)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_14)
       (pred_5 obj_10 obj_13)
       (pred_5 obj_14 obj_02)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_01)
       (pred_5 obj_14 obj_10)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_08 obj_18)
       (pred_5 obj_08 obj_19)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_08)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_14)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_04 obj_12)
       (pred_10 obj_01)
       (pred_10 obj_19)
       (pred_12  obj_01 obj_20)
       (pred_12  obj_19 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_16)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_07)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_8 obj_04)

       (pred_1  obj_03 obj_20)
       (pred_1  obj_15 obj_06)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_15 obj_17)
       (pred_9 obj_17)
    )

    (:goal (and
       (pred_2 obj_03 obj_02)
    ))
(:constraints
  (always (not (pred_9 obj_14)))
)
)

; plan
1. (op_4 obj_17 obj_15)
   deleted: (pred_2 obj_15 obj_17) (pred_3)
   added: (pred_7 obj_15)
   goals met: 0 of 1
2. (op_1 obj_17 obj_02)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_02)
   goals met: 0 of 1
3. (op_2 obj_02 obj_15)
   deleted: (pred_7 obj_15)
   added: (pred_3) (pred_2 obj_15 obj_02)
   goals met: 0 of 1
4. (op_1 obj_02 obj_17)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_17)
   goals met: 0 of 1
5. (op_1 obj_17 obj_10)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_13)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_13)
   goals met: 0 of 1
7. (op_1 obj_13 obj_05)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_05)
   goals met: 0 of 1
8. (op_1 obj_05 obj_09)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_09)
   goals met: 0 of 1
9. (op_4 obj_09 obj_03)
   deleted: (pred_2 obj_03 obj_09) (pred_3)
   added: (pred_7 obj_03)
   goals met: 0 of 1
10. (op_3 obj_09 obj_01 obj_03 obj_20)
   deleted: (pred_10 obj_01)
   added: (pred_8 obj_01)
   goals met: 0 of 1
11. (op_1 obj_09 obj_01)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_01)
   goals met: 0 of 1
12. (op_1 obj_01 obj_13)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_13)
   goals met: 0 of 1
13. (op_1 obj_13 obj_10)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_10)
   goals met: 0 of 1
14. (op_1 obj_10 obj_17)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_17)
   goals met: 0 of 1
15. (op_1 obj_17 obj_02)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_02)
   goals met: 0 of 1
16. (op_5 obj_02 obj_15 obj_03)
   deleted: (pred_7 obj_03) (pred_2 obj_15 obj_02)
   added: (pred_7 obj_15) (pred_2 obj_03 obj_02)
   goals met: 1 of 1
